src/Enums/КИИ_УровниКритичности/КИИ_УровниКритичности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КИИ_УровниКритичности</name>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
  <enumValues>
    <name>Средняя</name>
  </enumValues>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Критическая</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/КИИ_МониторингОшибокTelegram/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль: КИИ_МониторингОшибокTelegram
// Назначение: Отправка уведомлений мониторинга ошибок в Telegram (индивидуально/дайджест)
//             и хранение токена/ChatID в безопасном хранилище.
// Выделен из КИИ_МониторингОшибок (декомпозиция god-модуля, 2026-07-08).
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Отправляет результаты анализа в Telegram: дайджестом (если включен и >1) или по одному.
// Параметры:
//  Настройки - Структура - настройки мониторинга (ТокенБотаТелеграм, ChatIDТелеграм, РежимДайджеста).
//  МассивРезультатов - Массив - результаты анализа ошибок (структуры ДанныеОшибки, Критичность, Описание).
Процедура ОтправитьРезультатыВТелеграм(Настройки, МассивРезультатов) Экспорт

	ТокенТелеграм = Настройки.ТокенБотаТелеграм;
	ChatID        = Настройки.ChatIDТелеграм;

	Если НЕ ЗначениеЗаполнено(ТокенТелеграм) ИЛИ НЕ ЗначениеЗаполнено(ChatID) Тогда
		Возврат;
	КонецЕсли;

	Если Настройки.РежимДайджеста И МассивРезультатов.Количество() > 1 Тогда
		ОтправитьДайджестВТелеграм(ТокенТелеграм, ChatID, МассивРезультатов);
	Иначе
		ОтправитьРезультатыПоОтдельностиВТелеграм(ТокенТелеграм, ChatID, МассивРезультатов);
	КонецЕсли;

КонецПроцедуры

// Отправляет одно текстовое сообщение в Telegram (с обрезкой до лимита). Возвращает Булево - успех.
// Параметры:
//  ТокенТелеграм - Строка - токен бота Telegram.
//  ChatID - Строка - идентификатор чата Telegram.
//  ТекстСообщения - Строка - текст сообщения (обрезается до лимита).
// Возвращаемое значение:
//  Булево - Истина, если сообщение отправлено успешно.
Функция ОтправитьСообщениеВТелеграм(ТокенТелеграм, ChatID, ТекстСообщения) Экспорт

	Если НЕ КИИ_TelegramУведомления.ПроверитьДлинуСообщения(ТекстСообщения) Тогда
		ТекстСообщения = КИИ_TelegramУведомления.ОбрезатьСообщениеДоЛимита(ТекстСообщения);
	КонецЕсли;

	Результат = КИИ_TelegramУведомления.ОтправитьТекстовоеСообщение(
		ТокенТелеграм, ChatID, ТекстСообщения);

	Возврат (Результат["ok"] = Истина);

КонецФункции

// Формирует HTML-сообщение об ошибке для Telegram.
// Параметры:
//  ДанныеОшибки - Структура - данные ошибки (ТекстОшибки, Пользователь, Компьютер,
//                 Событие, ПерваяДатаВремя, КоличествоПовторений).
//  РезАнализа - Структура - результат анализа (Критичность, Описание).
//  ЭтоПовтор - Булево - признак повторной отправки.
//  ОбрезатьОписание - Булево - обрезать ли описание до 300 символов.
// Возвращаемое значение:
//  Строка - HTML-сообщение для Telegram.
// Конвертирует Markdown-диагноз LLM в Telegram-HTML. LLM отдаёт **жирный**, ```блоки кода```,
// `инлайн` - в parse_mode=HTML они не рендерятся и текут сырыми маркерами. Баланс тегов гарантируется.
Функция ФорматироватьОписаниеHTML(Знач Текст) Экспорт

	СтрокиТекста = СтрРазделить(ЗащититьHTML(Текст), Символы.ПС);
	Результат = Новый Массив;
	ВБлокеКода = Ложь;
	Для Каждого Строка Из СтрокиТекста Цикл
		Если СтрНачинаетсяС(СокрЛ(Строка), "```") Тогда
			Результат.Добавить(?(ВБлокеКода, "</pre>", "<pre>"));
			ВБлокеКода = Не ВБлокеКода;
			Продолжить;
		КонецЕсли;
		Если Не ВБлокеКода Тогда
			Строка = ЗаменитьПарныеМаркеры(Строка, "**", "<b>", "</b>");
			Строка = ЗаменитьПарныеМаркеры(Строка, "`", "<code>", "</code>");
		КонецЕсли;
		Результат.Добавить(Строка);
	КонецЦикла;
	Если ВБлокеКода Тогда
		Результат.Добавить("</pre>");
	КонецЕсли;
	Возврат СтрСоединить(Результат, Символы.ПС);

КонецФункции

// Собирает текст уведомления об ошибке в разметке Telegram HTML: заголовок с эмодзи по
// критичности, событие, счетчик повторений, текст ошибки и совет модели.
//
// Параметры:
//  ДанныеОшибки    - Структура, РезультатЗапроса.Выбрать() - поля записи журнала мониторинга
//                    (ТекстОшибки, Событие, КоличествоПовторений, Пользователь, Компьютер и пр.).
//  РезАнализа      - Структура:
//   * Критичность  - Строка - нормализованная критичность (определяет эмодзи).
//   * Описание     - Строка - совет модели (Markdown конвертируется в Telegram HTML).
//  ЭтоПовтор       - Булево - Истина для повторного уведомления (иной заголовок).
//  ОбрезатьОписание - Булево - Истина для дайджеста: описание урезается до лимита.
//
// Возвращаемое значение:
//  Строка - готовое к отправке сообщение (parse_mode=HTML).
//
Функция СформироватьСообщениеДляТелеграм(ДанныеОшибки, РезАнализа, ЭтоПовтор, ОбрезатьОписание = Ложь) Экспорт

	Emoji     = ПолучитьEmojiПоКритичности(РезАнализа.Критичность);
	Заголовок = СтрШаблон("%1 %2 Ошибка в 1С", Emoji, РезАнализа.Критичность);
	Если ЭтоПовтор Тогда
		Заголовок = Заголовок + " ⟳ ПОВТОРНО";
	КонецЕсли;

	ТекстОшибки = ДанныеОшибки.ТекстОшибки;
	// Убрать хвост [Категория, ...] - внутренние категории ошибки, читателю шум.
	ПозКатегорий = СтрНайти(ТекстОшибки, Символы.ПС + "[");
	Если ПозКатегорий > 0 Тогда
		ТекстОшибки = СокрП(Лев(ТекстОшибки, ПозКатегорий - 1));
	КонецЕсли;
	Если СтрДлина(ТекстОшибки) > 500 Тогда
		ТекстОшибки = Лев(ТекстОшибки, 300) + "...";
	КонецЕсли;

	Описание = РезАнализа.Описание;
	Если ОбрезатьОписание И СтрДлина(Описание) > 300 Тогда
		Описание = Лев(Описание, 297) + "...";
	КонецЕсли;

	Строки = Новый Массив;
	Строки.Добавить(СтрШаблон("<b>%1</b>", ЗащититьHTML(Заголовок)));
	Строки.Добавить("");
	Строки.Добавить(СтрШаблон("📅 %1", Формат(ДанныеОшибки.ПерваяДатаВремя, "ДЛФ=DT")));
	Строки.Добавить(СтрШаблон("👤 %1", ЗащититьHTML(ДанныеОшибки.Пользователь)));
	Строки.Добавить(СтрШаблон("💻 %1", ЗащититьHTML(ДанныеОшибки.Компьютер)));
	Строки.Добавить(СтрШаблон("📂 %1", ЗащититьHTML(ДанныеОшибки.Событие)));
	Строки.Добавить("");
	Строки.Добавить("🤖 <b>Анализ ИИ:</b>");
	Строки.Добавить(ФорматироватьОписаниеHTML(Описание));
	Строки.Добавить("");
	Строки.Добавить("📝 <b>Текст ошибки:</b>");
	Строки.Добавить(СтрШаблон("<code>%1</code>", ЗащититьHTML(ТекстОшибки)));

	Если ЭтоПовтор Тогда
		Строки.Добавить("");
		Строки.Добавить(СтрШаблон("🔄 Повторилась <b>%1</b> раз", ДанныеОшибки.КоличествоПовторений));
	КонецЕсли;

	Возврат СтрСоединить(Строки, Символы.ПС);

КонецФункции

// Подсчет количеств по уровням критичности для дайджеста.
// Параметры:
//  МассивРезультатов - Массив - результаты анализа ошибок.
// Возвращаемое значение:
//  Структура - счетчики по уровням критичности:
//   * Критическая - Число - число критических ошибок.
//   * Высокая - Число - число высоких ошибок.
//   * Средняя - Число - число средних ошибок.
//   * Низкая - Число - число низких ошибок.
Функция ПодсчитатьКритичностиДляДайджеста(Знач МассивРезультатов) Экспорт

	Счетчики = Новый Структура("Критическая, Высокая, Средняя", 0, 0, 0);
	Счетчики.Вставить("Низкая", 0);
	Для Каждого Элемент Из МассивРезультатов Цикл
		ИмяКритичности = ИмяКритичностиДляСчетчика(Элемент.Критичность);
		Если Не ПустаяСтрока(ИмяКритичности) И Счетчики.Свойство(ИмяКритичности) Тогда
			Счетчики[ИмяКритичности] = Счетчики[ИмяКритичности] + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат Счетчики;

КонецФункции

// Сохраняет токен Telegram в безопасное хранилище; пустое значение - удаляет ключ.
// Параметры:
//  Токен - Строка - токен бота Telegram (пустой - удалить ключ).
Процедура СохранитьТокенТелеграмВХранилище(Токен) Экспорт

	Попытка
		Если НЕ ЗначениеЗаполнено(Токен) Тогда
			ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(
				ВладелецБезопасногоХранилища(), "ТокенТелеграм");
		Иначе
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
				ВладелецБезопасногоХранилища(), Токен, "ТокенТелеграм");
		КонецЕсли;
	Исключение
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка сохранения токена Telegram: %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок'"),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Сохраняет ChatID Telegram в безопасное хранилище; пустое значение - удаляет ключ.
// Параметры:
//  ChatID - Строка - идентификатор чата Telegram (пустой - удалить ключ).
Процедура СохранитьChatIDТелеграмВХранилище(ChatID) Экспорт

	Попытка
		Если НЕ ЗначениеЗаполнено(ChatID) Тогда
			ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(
				ВладелецБезопасногоХранилища(), "ChatIDТелеграм");
		Иначе
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
				ВладелецБезопасногоХранилища(), ChatID, "ChatIDТелеграм");
		КонецЕсли;
	Исключение
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка сохранения ChatID Telegram: %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок'"),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Выполняет миграцию токенов Telegram из ХранилищаОбщихНастроек в БезопасноеХранилище.
// При первом чтении: если токены есть в настройках, но отсутствуют в безопасном хранилище,
// они переносятся. Значения в структуре настроек заменяются на данные из безопасного хранилища.
// Параметры:
//  Настройки - Структура - настройки мониторинга (ТокенБотаТелеграм, ChatIDТелеграм);
//              значения обновляются из хранилища.
Процедура ВыполнитьМиграциюТокеновТелеграм(Настройки) Экспорт

	ТокенИзХранилища  = ПолучитьТокенТелеграмИзХранилища();
	ChatIDИзХранилища = ПолучитьChatIDТелеграмИзХранилища();

	Если ЗначениеЗаполнено(ТокенИзХранилища) Тогда
		Настройки.ТокенБотаТелеграм = ТокенИзХранилища;
	ИначеЕсли ЗначениеЗаполнено(Настройки.ТокенБотаТелеграм) Тогда
		СохранитьТокенТелеграмВХранилище(Настройки.ТокенБотаТелеграм);
	Иначе
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ИИКона.МониторингОшибок'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru = 'Токен Telegram не задан - требуется настройка'"));
	КонецЕсли;

	Если ЗначениеЗаполнено(ChatIDИзХранилища) Тогда
		Настройки.ChatIDТелеграм = ChatIDИзХранилища;
	ИначеЕсли ЗначениеЗаполнено(Настройки.ChatIDТелеграм) Тогда
		СохранитьChatIDТелеграмВХранилище(Настройки.ChatIDТелеграм);
	Иначе
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ИИКона.МониторингОшибок'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru = 'ChatID Telegram не задан - требуется настройка'"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заменяет парные маркеры (** или `) на открывающий/закрывающий HTML-тег; висячий маркер закрывается.
Функция ЗаменитьПарныеМаркеры(Знач Строка, Знач Маркер, Знач ТегОткр, Знач ТегЗакр)

	Результат = "";
	Открыто = Ложь;
	ДлинаМ = СтрДлина(Маркер);
	Поз = 1;
	Пока Поз <= СтрДлина(Строка) Цикл
		Если Сред(Строка, Поз, ДлинаМ) = Маркер Тогда
			Результат = Результат + ?(Открыто, ТегЗакр, ТегОткр);
			Открыто = Не Открыто;
			Поз = Поз + ДлинаМ;
		Иначе
			Результат = Результат + Сред(Строка, Поз, 1);
			Поз = Поз + 1;
		КонецЕсли;
	КонецЦикла;
	Если Открыто Тогда
		Результат = Результат + ТегЗакр;
	КонецЕсли;
	Возврат Результат;

КонецФункции

// Отправить дайджест + критические ошибки отдельными сообщениями.
Процедура ОтправитьДайджестВТелеграм(Знач ТокенТелеграм, Знач ChatID, МассивРезультатов)

	ТекстДайджеста = СформироватьДайджестСообщение(МассивРезультатов);
	ДайджестОтправлен = ОтправитьСообщениеВТелеграм(ТокенТелеграм, ChatID, ТекстДайджеста);

	Если ДайджестОтправлен Тогда
		Для Каждого Элемент Из МассивРезультатов Цикл
			КИИ_МониторингОшибокРегистры.ОбновитьФлагОтправкиТелеграм(Элемент.ДанныеОшибки.ХешОшибки);
		КонецЦикла;

		// Критические ошибки - отдельным сообщением, ТОЛЬКО если дайджест доставлен: иначе тот же
		// недоступный канал дает лишние попытки и спам ошибок в ЖР (аудит P2).
		Для Каждого Элемент Из МассивРезультатов Цикл
			Если Элемент.Критичность = Перечисления.КИИ_УровниКритичности.Критическая Тогда
				ОтправитьКритическуюОшибкуВТелеграм(ТокенТелеграм, ChatID, Элемент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Отправить каждую ошибку отдельным сообщением, обновив флаг отправки при успехе.
Процедура ОтправитьРезультатыПоОтдельностиВТелеграм(Знач ТокенТелеграм, Знач ChatID, МассивРезультатов)

	Для Каждого Элемент Из МассивРезультатов Цикл
		Отправлено = ОтправитьОдинРезультатВТелеграм(ТокенТелеграм, ChatID, Элемент);
		Если Отправлено Тогда
			КИИ_МониторингОшибокРегистры.ОбновитьФлагОтправкиТелеграм(Элемент.ДанныеОшибки.ХешОшибки);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Отправить одно сообщение об ошибке в Телеграм.
Функция ОтправитьОдинРезультатВТелеграм(Знач ТокенТелеграм, Знач ChatID, Знач Элемент)

	РезАнализа = Новый Структура("Критичность, Описание", Элемент.Критичность, Элемент.Описание);
	ТекстСообщения = СформироватьСообщениеДляТелеграм(Элемент.ДанныеОшибки, РезАнализа, Ложь);
	Возврат ОтправитьСообщениеВТелеграм(ТокенТелеграм, ChatID, ТекстСообщения);

КонецФункции

// Отправить критическую ошибку отдельным сообщением (без обновления флага).
Процедура ОтправитьКритическуюОшибкуВТелеграм(Знач ТокенТелеграм, Знач ChatID, Знач Элемент)

	РезАнализа = Новый Структура("Критичность, Описание", Элемент.Критичность, Элемент.Описание);
	ТекстСообщения = СформироватьСообщениеДляТелеграм(Элемент.ДанныеОшибки, РезАнализа, Ложь);
	ОтправитьСообщениеВТелеграм(ТокенТелеграм, ChatID, ТекстСообщения);

КонецПроцедуры

Функция СформироватьДайджестСообщение(МассивРезультатов)

	Счетчики = ПодсчитатьКритичностиДляДайджеста(МассивРезультатов);

	Строки = Новый Массив;
	Строки.Добавить("<b>📊 Дайджест ошибок 1С</b>");
	Строки.Добавить("");
	Строки.Добавить(СтрШаблон("📈 Обработано: <b>%1</b> ошибок", МассивРезультатов.Количество()));
	ДобавитьСтрокиСчетчиковДайджеста(Строки, Счетчики);
	ДобавитьСтрокиТопОшибокДайджеста(Строки, МассивРезультатов);

	Строки.Добавить("");
	Строки.Добавить("ℹ️ Подробности - в регистре КИИ_МониторингОшибокЖурнал");

	Возврат СтрСоединить(Строки, Символы.ПС);

КонецФункции

// Строковый ключ счетчика дайджеста по значению перечисления критичности.
// Ключи Структуры обязаны быть строками - перечисление напрямую давало краш.
Функция ИмяКритичностиДляСчетчика(Знач Критичность)

	Если Критичность = Перечисления.КИИ_УровниКритичности.Критическая Тогда
		Возврат "Критическая";
	ИначеЕсли Критичность = Перечисления.КИИ_УровниКритичности.Высокая Тогда
		Возврат "Высокая";
	ИначеЕсли Критичность = Перечисления.КИИ_УровниКритичности.Средняя Тогда
		Возврат "Средняя";
	ИначеЕсли Критичность = Перечисления.КИИ_УровниКритичности.Низкая Тогда
		Возврат "Низкая";
	Иначе
		// Пустая ссылка либо новое значение перечисления: счетчик по такой критичности
		// не ведем (пустой ключ вызывающий пропускает).
		Возврат "";
	КонецЕсли;

КонецФункции

// Добавить строки-счетчики в дайджест.
Процедура ДобавитьСтрокиСчетчиковДайджеста(Строки, Знач Счетчики)

	Если Счетчики.Критическая > 0 Тогда
		Строки.Добавить(СтрШаблон("🚨 Критических: <b>%1</b>", Счетчики.Критическая));
	КонецЕсли;
	Если Счетчики.Высокая > 0 Тогда
		Строки.Добавить(СтрШаблон("🔴 Высоких: <b>%1</b>", Счетчики.Высокая));
	КонецЕсли;
	Если Счетчики.Средняя > 0 Тогда
		Строки.Добавить(СтрШаблон("⚠️ Средних: <b>%1</b>", Счетчики.Средняя));
	КонецЕсли;
	Если Счетчики.Низкая > 0 Тогда
		Строки.Добавить(СтрШаблон("ℹ️ Низких: <b>%1</b>", Счетчики.Низкая));
	КонецЕсли;

КонецПроцедуры

// Добавить строки топ-3 ошибок в дайджест.
Процедура ДобавитьСтрокиТопОшибокДайджеста(Строки, Знач МассивРезультатов)

	ТопОшибки = ВыбратьТопОшибки(МассивРезультатов, 3);
	Если ТопОшибки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Строки.Добавить("");
	Строки.Добавить("<b>Топ ошибки:</b>");
	Для Номер = 0 По ТопОшибки.ВГраница() Цикл
		Строки.Добавить(СформироватьСтрокуТопОшибки(Номер, ТопОшибки[Номер]));
	КонецЦикла;

КонецПроцедуры

// Сформировать строку одной ошибки в топе.
Функция СформироватьСтрокуТопОшибки(Знач Номер, Знач Элемент)

	Emoji    = ПолучитьEmojiПоКритичности(Элемент.Критичность);
	Описание = Элемент.Описание;
	Если СтрДлина(Описание) > 100 Тогда
		Описание = Лев(Описание, 97) + "...";
	КонецЕсли;
	Повторы = "";
	Если Элемент.ДанныеОшибки.КоличествоПовторений > 1 Тогда
		Повторы = СтрШаблон(" (×%1)", Элемент.ДанныеОшибки.КоличествоПовторений);
	КонецЕсли;
	Возврат СтрШаблон("%1. %2 %3%4",
		Номер + 1, Emoji, ЗащититьHTML(Описание), Повторы);

КонецФункции

Функция ВыбратьТопОшибки(МассивРезультатов, МаксимумОшибок)

	Результат = Новый Массив;

	ПорядокКритичности = Новый Массив;
	ПорядокКритичности.Добавить(Перечисления.КИИ_УровниКритичности.Критическая);
	ПорядокКритичности.Добавить(Перечисления.КИИ_УровниКритичности.Высокая);
	ПорядокКритичности.Добавить(Перечисления.КИИ_УровниКритичности.Средняя);
	ПорядокКритичности.Добавить(Перечисления.КИИ_УровниКритичности.Низкая);

	Для Каждого ТекущаяКритичность Из ПорядокКритичности Цикл
		Для Каждого Элемент Из МассивРезультатов Цикл
			Если Элемент.Критичность = ТекущаяКритичность Тогда
				Результат.Добавить(Элемент);
				Если Результат.Количество() >= МаксимумОшибок Тогда
					Возврат Результат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьEmojiПоКритичности(Критичность)

	Таблица = Новый Соответствие;
	Таблица.Вставить(Перечисления.КИИ_УровниКритичности.Низкая,       "ℹ️");
	Таблица.Вставить(Перечисления.КИИ_УровниКритичности.Средняя,      "⚠️");
	Таблица.Вставить(Перечисления.КИИ_УровниКритичности.Высокая,      "🔴");
	Таблица.Вставить(Перечисления.КИИ_УровниКритичности.Критическая,  "🚨");

	Результат = Таблица[Критичность];
	Возврат ?(Результат = Неопределено, "⚠️", Результат);

КонецФункции

Функция ЗащититьHTML(Текст)

	Результат = Строка(Текст);
	Результат = СтрЗаменить(Результат, "&",  "&amp;");
	Результат = СтрЗаменить(Результат, "<",  "&lt;");
	Результат = СтрЗаменить(Результат, ">",  "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	Возврат Результат;

КонецФункции

Функция ПолучитьТокенТелеграмИзХранилища()

	Попытка
		Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			ВладелецБезопасногоХранилища(), "ТокенТелеграм");
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции

Функция ПолучитьChatIDТелеграмИзХранилища()

	Попытка
		Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			ВладелецБезопасногоХранилища(), "ChatIDТелеграм");
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции

Функция ВладелецБезопасногоХранилища()

	Возврат "КИИ_МониторингОшибок";

КонецФункции

#КонецОбласти
